## [liquibase-docs-staging](https://liquibase.app.spacelift.io/stack/liquibase-docs-staging/run/01J4M6H6RD7JGH9ZNR9YPADT00) plan logs

<details>
<summary>Click here to expand</summary>

```
...
aws_s3_object.redirects["/parameters/ignore.html"]: Refreshing state... [id=/parameters/ignore.html]
aws_s3_object.redirects["/commands/maintenance/tag.html"]: Refreshing state... [id=/commands/maintenance/tag.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-list-locks.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-list-locks.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/changelogsynctotagsql.html"]: Refreshing state... [id=/tools-integrations/ant/commands/changelogsynctotagsql.html]
aws_s3_object.redirects["/start/tutorials/bigquery.html"]: Refreshing state... [id=/start/tutorials/bigquery.html]
aws_s3_object.redirects["/commands/config-ref/database-class.html"]: Refreshing state... [id=/commands/config-ref/database-class.html]
aws_s3_object.redirects["/2014/11/home.html"]: Refreshing state... [id=/2014/11/home.html]
aws_s3_object.redirects["/commands/maintenance/changelog-sync.html"]: Refreshing state... [id=/commands/maintenance/changelog-sync.html]
aws_s3_object.redirects["/start/tutorials/firebird.html"]: Refreshing state... [id=/start/tutorials/firebird.html]
aws_s3_object.redirects["/commands/status/status.html"]: Refreshing state... [id=/commands/status/status.html]
aws_s3_object.redirects["/commands/generatechangelog.html"]: Refreshing state... [id=/commands/generatechangelog.html]
aws_s3_object.redirects["/change-types/community/insert.html"]: Refreshing state... [id=/change-types/community/insert.html]
aws_s3_object.redirects["/concepts/advanced/preconditions.html"]: Refreshing state... [id=/concepts/advanced/preconditions.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/flipt-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/flipt-feature-flags-extension.html]
aws_s3_object.redirects["/commands/community/generatechangelog.html"]: Refreshing state... [id=/commands/community/generatechangelog.html]
aws_s3_object.redirects["/concepts/advanced/exception-handling.html"]: Refreshing state... [id=/concepts/advanced/exception-handling.html]
aws_s3_object.redirects["/start/tutorials/sqlite.html"]: Refreshing state... [id=/start/tutorials/sqlite.html]
aws_s3_object.redirects["/concepts/advanced/help.html"]: Refreshing state... [id=/concepts/advanced/help.html]
aws_s3_object.redirects["/concepts/changes/index.html"]: Refreshing state... [id=/concepts/changes/index.html]
aws_s3_object.redirects["/commands/community/history.html"]: Refreshing state... [id=/commands/community/history.html]
aws_s3_object.redirects["/install/tutorials/mariadb.html"]: Refreshing state... [id=/install/tutorials/mariadb.html]
aws_s3_object.redirects["/commands/updatetotagsql.html"]: Refreshing state... [id=/commands/updatetotagsql.html]
aws_s3_object.redirects["/commands/diff/diff-json.html"]: Refreshing state... [id=/commands/diff/diff-json.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-registerChangeLog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-registerChangeLog.html]
aws_s3_object.redirects["/commands/change-tracking/tag-exists.html"]: Refreshing state... [id=/commands/change-tracking/tag-exists.html]
aws_s3_object.redirects["/secrets-management"]: Refreshing state... [id=/secrets-management]
aws_s3_object.redirects["/concepts/changelogs/attributes/enddelimiter-sql-attribute.html"]: Refreshing state... [id=/concepts/changelogs/attributes/enddelimiter-sql-attribute.html]
aws_s3_object.redirects["/workflows/quality-checks/concepts/json-object.html"]: Refreshing state... [id=/workflows/quality-checks/concepts/json-object.html]
aws_s3_object.redirects["/change-types/pro/drop-package-body.html"]: Refreshing state... [id=/change-types/pro/drop-package-body.html]
aws_s3_object.redirects["/parameters/object-quoting-strategy.html"]: Refreshing state... [id=/parameters/object-quoting-strategy.html]
aws_s3_object.redirects["/change-types/community/add-primary-key.html"]: Refreshing state... [id=/change-types/community/add-primary-key.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.10.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.10.0.html]
aws_s3_object.redirects["/start/tutorials/mongodb.html"]: Refreshing state... [id=/start/tutorials/mongodb.html]
aws_s3_object.redirects["/commands/config-ref/outputfile-parameter.html"]: Refreshing state... [id=/commands/config-ref/outputfile-parameter.html]
aws_s3_object.redirects["/commands/quality-checks/concepts/getting-started-with-the-checks-command.html"]: Refreshing state... [id=/commands/quality-checks/concepts/getting-started-with-the-checks-command.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mariadb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/mariadb.html]
aws_s3_object.redirects["/commands/quality-checks/lab-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/lab-quality-checks.html]
aws_s3_object.redirects["/start/install/tutorials/firebird.html"]: Refreshing state... [id=/start/install/tutorials/firebird.html]
aws_s3_object.redirects["/start/tutorials/aws-redshift.html"]: Refreshing state... [id=/start/tutorials/aws-redshift.html]
aws_s3_object.redirects["/start/install/tutorials/impala-hive.html"]: Refreshing state... [id=/start/install/tutorials/impala-hive.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/voltdb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/voltdb.html]
aws_s3_object.redirects["/install/liquibase-macos.html"]: Refreshing state... [id=/install/liquibase-macos.html]
aws_s3_object.redirects["/2014/11/contexts-vs-labels.html"]: Refreshing state... [id=/2014/11/contexts-vs-labels.html]
aws_s3_object.redirects["/what-is-a-jdbc-url.html"]: Refreshing state... [id=/what-is-a-jdbc-url.html]
aws_s3_object.redirects["/tools-integrations/native-executors/msqql-server-sqlcmd.html"]: Refreshing state... [id=/tools-integrations/native-executors/msqql-server-sqlcmd.html]
aws_s3_object.redirects["/change-types/community/rename-sequence.html"]: Refreshing state... [id=/change-types/community/rename-sequence.html]
aws_s3_object.redirects["/commands/maintenance/tag-exists.html"]: Refreshing state... [id=/commands/maintenance/tag-exists.html]
aws_s3_object.redirects["/start/tutorials/sap-hana.html"]: Refreshing state... [id=/start/tutorials/sap-hana.html]
aws_s3_object.redirects["/commands/execute-sql.html"]: Refreshing state... [id=/commands/execute-sql.html]
aws_s3_object.redirects["/commands/quality-checks/copy.html"]: Refreshing state... [id=/commands/quality-checks/copy.html]
aws_s3_object.redirects["/start/getting-started-liquibase-xml.html"]: Refreshing state... [id=/start/getting-started-liquibase-xml.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mongodb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/mongodb.html]
aws_s3_object.redirects["/commands/quality-checks/checks/quality-checks-list.html"]: Refreshing state... [id=/commands/quality-checks/checks/quality-checks-list.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-updateSQL.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-updateSQL.html]
aws_s3_object.redirects["/workflows/liquibase-community/liquibase-auto-rollback.html"]: Refreshing state... [id=/workflows/liquibase-community/liquibase-auto-rollback.html]
aws_s3_object.redirects["/commands/config-ref/driver.html"]: Refreshing state... [id=/commands/config-ref/driver.html]
aws_s3_object.redirects["/workflows/liquibase-pro/stored-logic.html"]: Refreshing state... [id=/workflows/liquibase-pro/stored-logic.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollbackOneUpdate.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollbackOneUpdate.html]
aws_s3_object.redirects["/tools-integrations/ant/getting-started-liquibase-ant.html"]: Refreshing state... [id=/tools-integrations/ant/getting-started-liquibase-ant.html]
aws_s3_object.redirects["/parameters/command-parameters.html"]: Refreshing state... [id=/parameters/command-parameters.html]
aws_s3_object.redirects["/commands/config-ref/auto-reorg.html"]: Refreshing state... [id=/commands/config-ref/auto-reorg.html]
aws_s3_object.redirects["/concepts/changes/drop_table.html"]: Refreshing state... [id=/concepts/changes/drop_table.html]
aws_s3_object.redirects["/commands/config-ref/changelog-lock-wait-time-in-minutes-parameter.html"]: Refreshing state... [id=/commands/config-ref/changelog-lock-wait-time-in-minutes-parameter.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.24.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.24.0.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-server-future-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-server-future-reserved-keywords.html]
aws_s3_object.redirects["/change-types/community/sql-file.html"]: Refreshing state... [id=/change-types/community/sql-file.html]
aws_s3_object.redirects["/change-types/community/drop-sequence.html"]: Refreshing state... [id=/change-types/community/drop-sequence.html]
aws_s3_object.redirects["/concepts/installation/setup-gitlab-cicd.html"]: Refreshing state... [id=/concepts/installation/setup-gitlab-cicd.html]
aws_s3_object.redirects["/2014/11/popular-topics.html"]: Refreshing state... [id=/2014/11/popular-topics.html]
aws_s3_object.redirects["/start/getting-started-liquibase-json-windows.html"]: Refreshing state... [id=/start/getting-started-liquibase-json-windows.html]
aws_s3_object.redirects["/concepts/advanced/database-class.html"]: Refreshing state... [id=/concepts/advanced/database-class.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/sqlite.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/sqlite.html]
aws_s3_object.redirects["/concepts/basic/databasechangeloglock-table.html"]: Refreshing state... [id=/concepts/basic/databasechangeloglock-table.html]
aws_s3_object.redirects["/concepts/ant/index.html"]: Refreshing state... [id=/concepts/ant/index.html]
aws_s3_object.redirects["/commands/config-ref/diff-column-order.html"]: Refreshing state... [id=/commands/config-ref/diff-column-order.html]
aws_s3_object.redirects["/commands/community/updatecountsql.html"]: Refreshing state... [id=/commands/community/updatecountsql.html]
aws_s3_object.redirects["/workflows/liquibase-community/using-the-run-job-pipeline-stage-with-spinnaker.html"]: Refreshing state... [id=/workflows/liquibase-community/using-the-run-job-pipeline-stage-with-spinnaker.html]
aws_s3_object.redirects["/feature-flags.html"]: Refreshing state... [id=/feature-flags.html]
aws_s3_object.redirects["/commands/future-rollback-from-tag-sql.html"]: Refreshing state... [id=/commands/future-rollback-from-tag-sql.html]
aws_s3_object.redirects["/commands/community/updatecount.html"]: Refreshing state... [id=/commands/community/updatecount.html]
aws_s3_object.redirects["/commands/update/validate.html"]: Refreshing state... [id=/commands/update/validate.html]
aws_s3_object.redirects["/start/install/tutorials/mariadb.html"]: Refreshing state... [id=/start/install/tutorials/mariadb.html]
aws_s3_object.redirects["/start/install/tutorials/teradata.html"]: Refreshing state... [id=/start/install/tutorials/teradata.html]
aws_s3_object.redirects["/commands/community/listlocks.html"]: Refreshing state... [id=/commands/community/listlocks.html]
aws_s3_object.redirects["/drift-reports.html"]: Refreshing state... [id=/drift-reports.html]
aws_s3_object.redirects["/concepts/advanced/includeall.html"]: Refreshing state... [id=/concepts/advanced/includeall.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-revoke-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-revoke-warn.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-changelogSyncSQL.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-changelogSyncSQL.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-json-on-linux-macos.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-json-on-linux-macos.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/postgresql.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/postgresql.html]
aws_s3_object.redirects["/tools-integrations/cli/home.html"]: Refreshing state... [id=/tools-integrations/cli/home.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/run-on-change.html"]: Refreshing state... [id=/concepts/changelogs/attributes/run-on-change.html]
aws_s3_object.redirects["/start/tutorials/cloud-spanner.html"]: Refreshing state... [id=/start/tutorials/cloud-spanner.html]
aws_s3_object.redirects["/start/install/tutorials/mssql-integrated-security-kerberos-authentication.html"]: Refreshing state... [id=/start/install/tutorials/mssql-integrated-security-kerberos-authentication.html]
aws_s3_object.redirects["/documentation/command_line"]: Refreshing state... [id=/documentation/command_line]
aws_s3_object.redirects["/commands/config-ref/liquibase-tablespace-name.html"]: Refreshing state... [id=/commands/config-ref/liquibase-tablespace-name.html]
aws_s3_object.redirects["/concepts/advanced/outputfile-parameter.html"]: Refreshing state... [id=/concepts/advanced/outputfile-parameter.html]
aws_s3_object.redirects["/commands/rollbackcount.html"]: Refreshing state... [id=/commands/rollbackcount.html]
aws_s3_object.redirects["/commands/change-tracking/changelog-sync-to-tag-sql.html"]: Refreshing state... [id=/commands/change-tracking/changelog-sync-to-tag-sql.html]
aws_s3_object.redirects["/install/tutorials/impala-hive.html"]: Refreshing state... [id=/install/tutorials/impala-hive.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollbackOneChangeSet.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollbackOneChangeSet.html]
aws_s3_object.redirects["/commands/liquibase-start/init-project.html"]: Refreshing state... [id=/commands/liquibase-start/init-project.html]
aws_s3_object.redirects["/commands/quality-checks/checks-bulk-set.html"]: Refreshing state... [id=/commands/quality-checks/checks-bulk-set.html]
aws_s3_object.redirects["/commands/change-tracking/changelog-sync-to-tag.html"]: Refreshing state... [id=/commands/change-tracking/changelog-sync-to-tag.html]
aws_s3_object.redirects["/start/install/tutorials/enterprisedb.html"]: Refreshing state... [id=/start/install/tutorials/enterprisedb.html]
aws_s3_object.redirects["/install/tutorials/bigquery.html"]: Refreshing state... [id=/install/tutorials/bigquery.html]
aws_s3_object.redirects["/commands/quality-checks/checks/git-bash-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/checks/git-bash-quality-checks.html]
aws_s3_object.redirects["/commands/updatesql.html"]: Refreshing state... [id=/commands/updatesql.html]
aws_s3_object.redirects["/concepts/databasechangelog-table.html"]: Refreshing state... [id=/concepts/databasechangelog-table.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-yaml-on-windows.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-yaml-on-windows.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cloud-spanner.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cloud-spanner.html]
aws_s3_object.redirects["/feature-flags/readmes/GrowthBook Feature Flags Extension_1.html"]: Refreshing state... [id=/feature-flags/readmes/GrowthBook Feature Flags Extension_1.html]
aws_s3_object.redirects["/commands/marknextchangesetran.html"]: Refreshing state... [id=/commands/marknextchangesetran.html]
aws_s3_object.redirects["/concepts/installation/installation-linux-unix-mac.html"]: Refreshing state... [id=/concepts/installation/installation-linux-unix-mac.html]
aws_s3_object.redirects["/start/tutorials/db2onzdeploy-sql.html"]: Refreshing state... [id=/start/tutorials/db2onzdeploy-sql.html]
aws_s3_object.redirects["/start/tutorials/cassandra-astra.html"]: Refreshing state... [id=/start/tutorials/cassandra-astra.html]
aws_s3_object.redirects["/commands/diff.html"]: Refreshing state... [id=/commands/diff.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/launchdarkly-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/launchdarkly-feature-flags-extension.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-sql-linux.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-sql-linux.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/oracle-atp-db.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/oracle-atp-db.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-clearCheckSums.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-clearCheckSums.html]
aws_s3_object.redirects["/commands/quality-checks/working-with-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/working-with-quality-checks.html]
aws_s3_object.redirects["/concepts/basic/changeset.html"]: Refreshing state... [id=/concepts/basic/changeset.html]
aws_s3_object.redirects["/concepts/basic/liquibase-environment-variables.html"]: Refreshing state... [id=/concepts/basic/liquibase-environment-variables.html]
aws_s3_object.redirects["/tools-integrations/observability/structured-logging-custom-data.html"]: Refreshing state... [id=/tools-integrations/observability/structured-logging-custom-data.html]
aws_s3_object.redirects["/flow.html"]: Refreshing state... [id=/flow.html]
aws_s3_object.redirects["/workflows/liquibase-community/homebrew-installation-for-macos.html"]: Refreshing state... [id=/workflows/liquibase-community/homebrew-installation-for-macos.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-grant-warn.html]
aws_s3_object.redirects["/start/install/tutorials/mongodb.html"]: Refreshing state... [id=/start/install/tutorials/mongodb.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.17.2.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.17.2.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.14.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.14.0.html]
aws_s3_object.redirects["/tools-integrations/native-executors/best-practices.html"]: Refreshing state... [id=/tools-integrations/native-executors/best-practices.html]
aws_s3_object.redirects["/install/liquibase-installation-troubleshooting.html"]: Refreshing state... [id=/install/liquibase-installation-troubleshooting.html]
aws_s3_object.redirects["/commands/registerchangelog.html"]: Refreshing state... [id=/commands/registerchangelog.html]
aws_s3_object.redirects["/commands/quality-checks/checks/lab-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/checks/lab-quality-checks.html]
aws_s3_object.redirects["/start/tutorials/mongodb-pro.html"]: Refreshing state... [id=/start/tutorials/mongodb-pro.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changeset-comment-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/changeset-comment-check.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.18.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.18.0.html]
aws_s3_object.redirects["/commands/liquibase-environment-variables.html"]: Refreshing state... [id=/commands/liquibase-environment-variables.html]
aws_s3_object.redirects["/commands/flow/advance-flow-file.html"]: Refreshing state... [id=/commands/flow/advance-flow-file.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollback-one-changeset.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollback-one-changeset.html]
aws_s3_object.redirects["/concepts/advanced/diff-column-order.html"]: Refreshing state... [id=/concepts/advanced/diff-column-order.html]
aws_s3_object.redirects["/start/tutorials/cosmosdb.html"]: Refreshing state... [id=/start/tutorials/cosmosdb.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cassandra.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cassandra.html]
aws_s3_object.redirects["/commands/history.html"]: Refreshing state... [id=/commands/history.html]
aws_s3_object.redirects["/commands/rollbackcountsql.html"]: Refreshing state... [id=/commands/rollbackcountsql.html]
aws_s3_object.redirects["/bigquery"]: Refreshing state... [id=/bigquery]
aws_s3_object.redirects["/commands/quality-checks/getting-started-with-the-checks-command.html"]: Refreshing state... [id=/commands/quality-checks/getting-started-with-the-checks-command.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/column.html"]: Refreshing state... [id=/concepts/changelogs/attributes/column.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.17.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.17.0.html]
aws_s3_object.redirects["/workflows/liquibase-pro/generateviewsql.html"]: Refreshing state... [id=/workflows/liquibase-pro/generateviewsql.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.9.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.9.1.html]
aws_s3_object.redirects["/commands/config-ref/output-line-separator.html"]: Refreshing state... [id=/commands/config-ref/output-line-separator.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/include.html"]: Refreshing state... [id=/concepts/changelogs/attributes/include.html]
aws_s3_object.redirects["/commands/community/clearchecksums.html"]: Refreshing state... [id=/commands/community/clearchecksums.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-json-macos.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-json-macos.html]
aws_s3_object.redirects["/commands/change-tracking/mark-next-changeset-ran.html"]: Refreshing state... [id=/commands/change-tracking/mark-next-changeset-ran.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mongodb"]: Refreshing state... [id=/workflows/database-setup-tutorials/mongodb]
aws_s3_object.redirects["/commands/community/registerchangelog.html"]: Refreshing state... [id=/commands/community/registerchangelog.html]
aws_s3_object.redirects["/concepts/advanced/include-system-classpath-parameter.html"]: Refreshing state... [id=/concepts/advanced/include-system-classpath-parameter.html]
aws_s3_object.redirects["/commands/maintenance/mark-next-changeset-ran.html"]: Refreshing state... [id=/commands/maintenance/mark-next-changeset-ran.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/marknextchangesetran.html"]: Refreshing state... [id=/tools-integrations/ant/commands/marknextchangesetran.html]
aws_s3_object.redirects["/start/install/tutorials/aws-redshift.html"]: Refreshing state... [id=/start/install/tutorials/aws-redshift.html]
aws_s3_object.redirects["/start/install/tutorials/sap-adaptive-server-enterprise-sap-ase.html"]: Refreshing state... [id=/start/install/tutorials/sap-adaptive-server-enterprise-sap-ase.html]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_object.redirects["/commands/flow/advance-flow-file.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/flow/advance-flow-file.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/flow/advanced-flow-file.html" -> "/liquibase-pro/flow/advanced-flow-file.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/flow/advanced-flow-file.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/flow/advanced-flow-file.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/flow/advanced-flow-file.html"
    }

  # aws_s3_object.redirects["/commands/flow/conditionals.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/flow/conditionals.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/flow/conditionals.html"
    }

  # aws_s3_object.redirects["/commands/flow/if-conditionals.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/flow/if-conditionals.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/flow/conditionals.html" -> "/liquibase-pro/flow/conditionals.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/flow/shell-commands.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/flow/shell-commands.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/flow/shell-commands.html"
    }

  # aws_s3_object.redirects["/commands/flow/variables.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/flow/variables.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/flow/variables.html"
    }

  # aws_s3_object.redirects["/dropall"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/dropall.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/labs/advance-flow-file.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/labs/advance-flow-file.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/flow/advanced-flow-file.html" -> "/liquibase-pro/flow/advanced-flow-file.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/labs/if-conditionals.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/labs/if-conditionals.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/flow/conditionals.html" -> "/liquibase-pro/flow/conditionals.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/labs/shell-commands.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/labs/shell-commands.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/flow/shell-commands.html" -> "/liquibase-pro/flow/shell-commands.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/labs/variables.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/tools-integrations/labs/variables.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/flow/variables.html" -> "/liquibase-pro/flow/variables.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/benefits.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/benefits.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/benefits.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/best-practices.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/best-practices.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/best-practices.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/home.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/mongodb-mongosh.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/mongodb-mongosh.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/mongodb-mongosh.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/oracle-sqlplus-proxy-user.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/oracle-sqlplus-proxy-user.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/oracle-sqlplus-proxy-user.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/oracle-sqlplus-troubleshoot.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/oracle-sqlplus-troubleshoot.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/oracle-sqlplus-troubleshoot.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/oracle-sqlplus.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/oracle-sqlplus.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/oracle-sqlplus.html"
    }

  # aws_s3_object.redirects["/tools-integrations/native-executors/postgresql-psql.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/native-executors/postgresql-psql.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/native-executors/postgresql-psql.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/home.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-checks-report.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports-checks-report.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports-checks-report.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-drift-report.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports-drift-report.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports-drift-report.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-rollback-report.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports-rollback-report.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports-rollback-report.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports-update-report.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports-update-report.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports-update-report.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/operation-reports.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/operation-reports.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/operation-reports.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/structured-logging-custom-data.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/structured-logging-custom-data.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/structured-logging-custom-data.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/structured-logging-keys.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/structured-logging-keys.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/structured-logging-keys.html"
    }

  # aws_s3_object.redirects["/tools-integrations/observability/structured-logging.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/tools-integrations/observability/structured-logging.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/observability/structured-logging.html"
    }

  # aws_s3_object.redirects["/workflows/liquibase-community/modify-sql.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/workflows/liquibase-community/modify-sql.html"
      ~ metadata               = {
          - "user-agent"    = "AWSTransfer" -> null
          - "user-agent-id" = "avelonis@s-53428b82285849a98" -> null
        }
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      + website_redirect       = "/change-types/modify-sql.html"
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/workflows/liquibase-pro/extensions-list.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/workflows/liquibase-pro/extensions-list.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/extensions-list.html"
    }

  # aws_s3_object.redirects["/workflows/liquibase-pro/generateviewsql.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/workflows/liquibase-pro/generateviewsql.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/stored-logic/generateviewsql.html"
    }

  # aws_s3_object.redirects["/workflows/liquibase-pro/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/workflows/liquibase-pro/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/home.html"
    }

  # aws_s3_object.redirects["/workflows/liquibase-pro/how-to-apply-your-liquibase-pro-license-key.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/workflows/liquibase-pro/how-to-apply-your-liquibase-pro-license-key.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/license-key.html"
    }

  # aws_s3_object.redirects["/workflows/liquibase-pro/mariadbgrants.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/workflows/liquibase-pro/mariadbgrants.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/stored-logic/mariadbgrants.html"
    }

  # aws_s3_object.redirects["/workflows/liquibase-pro/mysqlgrants.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/workflows/liquibase-pro/mysqlgrants.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/stored-logic/mysqlgrants.html"
    }

  # aws_s3_object.redirects["/workflows/liquibase-pro/mysqlsecuritycontext.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/workflows/liquibase-pro/mysqlsecuritycontext.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/stored-logic/mysqlsecuritycontext.html"
    }

  # aws_s3_object.redirects["/workflows/liquibase-pro/stored-logic.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/workflows/liquibase-pro/stored-logic.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/stored-logic/home.html"
    }

Plan: 29 to add, 9 to change, 0 to destroy.

[01J4KFWH65ZSJ0GBC0S378YN83] Changes are GO
[01J4KFWH65ZSJ0GBC0S378YN83] Uploading the list of managed resources...
[01J4KFWH65ZSJ0GBC0S378YN83] Generating Infracost JSON report from plan

[01J4KFWH65ZSJ0GBC0S378YN83] Infracost report generated successfully
[01J4KFWH65ZSJ0GBC0S378YN83] Mapping Infracost data to resources
[01J4KFWH65ZSJ0GBC0S378YN83] Costs mapped successfully
[01J4KFWH65ZSJ0GBC0S378YN83] Please be aware that the run changes calculation includes output changes.
[01J4KFWH65ZSJ0GBC0S378YN83] Resource list upload is GO
[01J4KFWH65ZSJ0GBC0S378YN83] Generating JSON representation of the plan...
[01J4KFWH65ZSJ0GBC0S378YN83] JSON representation is GO
[01J4KFWH65ZSJ0GBC0S378YN83] Generating Infracost JSON report from plan

[01J4KFWH65ZSJ0GBC0S378YN83] Infracost report generated successfully
[01J4KFWH65ZSJ0GBC0S378YN83] Loading custom plan policy inputs...
[01J4KFWH65ZSJ0GBC0S378YN83] 0 custom plan policy inputs found
[01J4KFWH65ZSJ0GBC0S378YN83] No plan policies to evaluate
```

</details>